<template>
  <div class="about">
    <h1>Задача</h1>
    Разработать web-приложение, реализующее следующую функциональность:<br/>
    Страница каталога предложений - аналог https://sozvezdie-tour.ru/cat/<br/><br/>
    выводит “карточки” предложений с дополнительной информацией: титульная фотография, название, краткое описание, ближайший период и минимальная цена;<br/>
    каждая карточка является ссылкой на страницу детальной информации.<br/>
    Страница детальной информации - кроме данных из карточки, выводит дополнительную расширенную информацию:<br/>
    маршрут - в виде списка городов;<br/>
    детальное текстовое описание;<br/>
    фотографии - в виде альбома.<br/>
    <h1>Требования к реализации</h1>
    Оформление может быть выполнено в близком к оригиналу стиле или любом другом, приемлемом для восприятия потенциального пользователя (с использованием любых инструментов - например, любимого css framework);<br/>
    <h2>Серверная часть:</h2>
    должна быть выполнена в виде ASP.NET MVC или WebApi 2 проекта для MS Visual Studio с использование .NET Framework 4.5+;<br/>
    предоставлять методы передачи клиенту тестовых данных в формате JSON.<br/>
    <h2>Клиентская часть:</h2>
    может быть реализована в виде SPA приложения (с использованием любого привычного инструмента - React или Angular/Vue.js);<br/>
    либо страницы могут формироваться на сервере, с использованием ASP.NET MVC и шаблонизатора Razor;<br/>
    клиент получает данные асинхронно с использованием AJAX запросов (запросы можно делать чистым JsvaScript или с помощью библиотек, например jQuery).<br/>
    <h1>Дополнительное задание</h1>
    Поскольку формат тестового задания не предполагает большие временные затраты для “полировки” внешнего вида и пользовательского взаимодействия или реализации непредусмотренных задачей фич, то дополнительным плюсом будет список предложений по улучшению прототипа как в визуальном, так и в функциональном плане.<br/>
    <h1>Демонстрация результатов</h1>
    Желательно предоставить репозиторий с историей изменения кода (Git, SVN, ссылка на github). Если опыт работы с репозиториями отсутствует, то можно прислать архив с проектом.<br/>
  </div>
</template>

<style scoped="">
  .about {
    text-align: justify;
    margin: 20px;
  }
</style>
